SectionnerServer/Sectionner.GetServerOptions.res.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns="Sectionner">
 <SOAP-ENV:Body>
  <!-- ns__GetServerOptions(..., ns__ServerOptions &serverOptions) -->
  <ns:ServerOptions>
   <!-- ns__DataBase soDataBase -->
   <soDataBase>
    <!-- std::string dbServer -->
    <dbServer></dbServer>
    <!-- int bdPort -->
    <bdPort>0</bdPort>
    <!-- std::string dbUser -->
    <dbUser></dbUser>
    <!-- std::string dbPassWord -->
    <dbPassWord></dbPassWord>
    <!-- ns__ErrorCode dbErr -->
    <dbErr>
     <!-- int eNo -->
     <eNo>0</eNo>
     <!-- std::string eMsg -->
     <eMsg></eMsg>
     <!-- enum ns__SettingLevel eType -->
     <eType>Normal</eType>
    </dbErr>
   </soDataBase>
   <!-- int soRepeat -->
   <soRepeat>0</soRepeat>
   <!-- ns__ErrorCode soErr -->
   <soErr>
    <!-- int eNo -->
    <eNo>0</eNo>
    <!-- std::string eMsg -->
    <eMsg></eMsg>
    <!-- enum ns__SettingLevel eType -->
    <eType>Normal</eType>
   </soErr>
  </ns:ServerOptions>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
